
Процедура ПередНачаломРаботыСистемы(Отказ)
  //  Каталог = "D:\meta-xsd\";
  //Для Каждого Пакет из ФабрикаXDTO.Пакеты Цикл
  //  Если Пакет.URIПространстваИмен = "http://www.w3.org/2001/XMLSchema" Тогда
  //    Продолжить;
  //  КонецЕсли;   
  //  
  //  Имя = СтрЗаменить(Пакет.URIПространстваИмен, "http://", "");
  //  Имя = СтрЗаменить(Имя, "/", "_");
  //  
  //  НаборСхем = ФабрикаXDTO.ЭкспортСхемыXML(Пакет.URIПространстваИмен);
  //  Для Счетчик = 0 по НаборСхем.Количество() - 1 Цикл
  //    Схема = НаборСхем.Получить(Счетчик);
  //    Схема.ОбновитьЭлементDOM();
  //    ЗаписьDOM = Новый ЗаписьDOM;
  //    ЗаписьXMLСтрока = Новый ЗаписьXML;
  //    ЗаписьXMLСтрока.УстановитьСтроку();
  //    ЗаписьXMLФайл = Новый ЗаписьXML;
  //    ЗаписьDOM.Записать(Схема.ДокументDOM, ЗаписьXMLСтрока);
  //    ЗаписьXMLФайл.ОткрытьФайл(СтрШаблон("%1\%2.xsd", Каталог, Имя));
  //    ЗаписьXMLФайл.ЗаписатьБезОбработки(ЗаписьXMLСтрока.Закрыть());
  //    ЗаписьXMLФайл.Закрыть();
  //    Прервать;
  //  КонецЦикла;   
  //КонецЦикла;
КонецПроцедуры
