
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("Реквизит1");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Сообщить("ПередЗаписьюМФ");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Справочник1.Наименование КАК Наименование,
	|	Справочник1.Предопределенный КАК Предопределенный
	|ИЗ
	|	Справочник.Справочник1 КАК Справочник1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СправочникБезСинонима КАК СправочникБезСинонима
	|		ПО Справочник1.Ссылка = СправочникБезСинонима.Ссылка";
	ВызватьИсключение "Тест";
КонецПроцедуры
